load-test/campaigns/2026-08-04_read-ceiling/scenarios/place-list-popular-readonly-500.yml
# 읽기 전용 상한 탐색 — 도착 500/s (실처리 ≈600 req/s) — 등록 추가분: ../README.md
# 믹스·구조는 300 시나리오와 동일, phases의 rate만 다르다. 300 통과(DB CPU 43%) 후
# "어디까지 받는가"를 확인하는 지점. 같은 호스트의 생성기가 먼저 포화할 수 있으므로
# artillery 프로세스 CPU를 함께 기록하고, 달성률 미달 시 생성기/서버를 구분 판정한다.
config:
  target: "http://localhost:8082"
  payload:
    # campaigns/<캠페인>/scenarios/ 기준 (실제 파일: load-test/data/users.csv)
    path: "../../../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 20
    - name: "Ramp up"
      duration: 30
      arrivalRate: 30
      rampTo: 500
    - name: "Sustained load"
      duration: 120
      arrivalRate: 500
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # 동네 단위 인기순 첫 페이지 — 서울 leaf(301~318) 편중을 그대로 반영. 홈 기본 진입
  - name: "popular-town"
    weight: 40
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (popular town)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 시 단위 (서울 전체 = leaf 18개 합집합) — filesort가 남는 비싼 경로
  - name: "popular-city"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (popular city)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 태그 필터 조합 — 같은 쿼리에 EXISTS 서브쿼리가 붙는 변형
  - name: "popular-tag-filter"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: "{{ $randomNumber(301, 318) }}"
            isBookmarkSearch: false
            sort: "POPULAR"
            mainTagId: "{{ $randomNumber(1, 6) }}"
            size: 20
          name: "GET /api/places (popular tag)"
          headers:
            Authorization: "Bearer {{ token }}"

  # 무한 스크롤: 1페이지 → nextCursor로 2페이지 (vuser당 요청 2건 — 실처리 환산 계수의 출처)
  - name: "popular-scroll"
    weight: 20
    flow:
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
          name: "GET /api/places (scroll p1)"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            json: "$.data.nextCursor"
            as: "nextCursor"
      - get:
          url: "/api/places"
          qs:
            townId: 201
            isBookmarkSearch: false
            sort: "POPULAR"
            size: 20
            cursor: "{{ nextCursor }}"
          name: "GET /api/places (scroll p2)"
          headers:
            Authorization: "Bearer {{ token }}"
          ifTrue: "nextCursor"